# Occupation

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [4]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. Discover what is the mean age per occupation

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [12]:
df = users.groupby(['occupation','gender'], as_index=False).count()[['occupation','gender','age']]
df.rename(columns={'age':'conteo'},inplace=True)
df['suma'] = df.groupby('occupation')['conteo'].transform('sum')
df['Ratio'] = df['conteo'] / df['suma']

df.loc[df.gender=='M'].sort_values('Ratio', ascending=False)

       occupation gender  conteo  suma     Ratio
4          doctor      M       7     7  1.000000
8        engineer      M      65    67  0.970149
38     technician      M      26    27  0.962963
30        retired      M      13    14  0.928571
28     programmer      M      60    66  0.909091
12      executive      M      29    32  0.906250
34      scientist      M      28    31  0.903226
10  entertainment      M      16    18  0.888889
18         lawyer      M      10    12  0.833333
32       salesman      M       9    12  0.750000
6        educator      M      69    95  0.726316
36        student      M     136   196  0.693878
26          other      M      69   105  0.657143
22      marketing      M      16    26  0.615385
40         writer      M      26    45  0.577778
24           none      M       5     9  0.555556
1   administrator      M      43    79  0.544304
3          artist      M      15    28  0.535714
20      librarian      M      22    51  0.431373
14     healthcare      M       5    16  0.312500
16      homemaker      M       1     7  0.142857

### Step 6. For each occupation, calculate the minimum and maximum ages

### Step 7. For each combination of occupation and gender, calculate the mean age

### Step 8.  For each occupation present the percentage of women and men